<?php

/*
 *  Пример определения и использования обычных функций
 */
function a($a, $b) {
    return $a + $b;
}

function b(int $a, $b = 3){
    return $a * b;
}

function c(float $a, int &...$b){
    return $a + $b[0];
}

$_a = a(1, 2);
$_b = b(1, 2);
$_c = c(1, 2, 3);

/*
 *  Пример определения и использования стрелочных функций
 */
$d = fn($a, $b) => $a + $b;
$e = fn(int $a, float &...$b) => {
    return $a * $b[0];
};

$d(1, 2);
$e(1, 2, 3);

/*
 *  Пример определения и использования анонимных функций
 */
$f = function ($a, $b) {
    return $a + $b;
};
$f(1, 2);
